Revit 2027 API
DividedPath.MaximumDistance Property
 The maximum distance is used when the layout is set to 'MaximumSpacing'. When that layout rule is used the distance between points will not exceed this value. The measurement type determines how the distance is measured.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MaximumDistance { get; set; }
Public Property MaximumDistance As Double
	Get
	Set
public:
property double MaximumDistance {
	double get ();
	void set (double value);
}
member MaximumDistance : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The maximumDistance is too small.
See Also
Reference
DividedPath Class
Autodesk.Revit.DB Namespace